//////////////////////////////////////////////////////////////////////////
// Задание номер №1
//////////////////////////////////////////////////////////////////////////

// var firstValue = prompt('Введите первое число:', '');
// var secondValue = prompt('Введите второе число:', '');

// if (firstValue == null || secondValue == null) {
//    alert('Ошибка');
// } else {
//    if (+firstValue > +secondValue) {
//       alert('Первое число больше второго');
//    } else if (+firstValue < +secondValue) {
//       alert('Второе число больше первого');
//    } else if (+firstValue ==  +secondValue) {
//       alert('Числа равны');
//    } else {
//       alert('Ошибка');
//    }
// }

//////////////////////////////////////////////////////////////////////////
                  // Задание номер №2
//////////////////////////////////////////////////////////////////////////

// var minValue = prompt('Введите год начала отсчета:', '');
// var maxValue = prompt('Введите год конца отсчета:', '');
//
// if (maxValue > minValue) {
//    for (var i = 1900; i <= 2019; i ++) {
//       if (i % 4 == 0  && (i % 100 != 0) || (i % 400 == 0)) {
//          console.log(i);
//       }
//    }
// } else {
//    console.log('Данные введены некоректно')
// }

//////////////////////////////////////////////////////////////////////////
                  // Задание номер №3
//////////////////////////////////////////////////////////////////////////

// var counter = 0;
// var wrongValueCounter = 0;
//
// while (true) {
//    var value = prompt('Введите число','');
//
//    if (value != null) {
//       counter += (+value);
//    } else if (typeof +value == 'number') {
//       wrongValueCounter++;
//       console.log('Ошибка!\nВы ввели неправильно значение, у Вас осталось ' + wrongValueCounter + ' из 3 попытки');
//          if (wrongValueCounter == 3) {
//             console.log('Вы использовали все попыки :( ');
//             break;
//          }
//    } else {
//       console.log('Сумма введеных чисел = ' + counter);
//       break;
//    }
// }
